In [1]:
import explore_warnings
import typedef
import report

import pandas as pd
import seaborn as sns
from IPython.core.display import display, HTML, Markdown

In [2]:
data = sns.load_dataset('titanic')

In [3]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
explore_warnings.missing_values(data, True)

None

{'survived': 0,
 'pclass': 0,
 'sex': 0,
 'age': 177,
 'sibsp': 0,
 'parch': 0,
 'fare': 0,
 'embarked': 2,
 'class': 0,
 'who': 0,
 'adult_male': 0,
 'deck': 688,
 'embark_town': 2,
 'alive': 0,
 'alone': 0}

In [5]:
report.to_html(res)

NameError: name 'res' is not defined

In [ ]:
display(HTML('<h1 style="background-color:DodgerBlue;">Hello World</h1>'))

In [ ]:
def style_negative(v, props=''):
    return props if v < 0 else None

In [ ]:
df = pd.DataFrame({'a':[1, 2, 4], 'b':[-3, 5, -7]})
df.style.applymap(style_negative, props='color:red;')

In [ ]:
pal = sns.light_palette("red", as_cmap=True)
df.style.background_gradient(cmap=pal)